docs/uml/packages_Galaga.dot
digraph "packages_Galaga" {
rankdir=BT
charset="utf-8"
"engine" [color="black", label=<engine>, shape="box", style="solid"];
"engine.assets" [color="black", label=<engine.assets>, shape="box", style="solid"];
"engine.audio" [color="black", label=<engine.audio>, shape="box", style="solid"];
"engine.input" [color="black", label=<engine.input>, shape="box", style="solid"];
"engine.scene" [color="black", label=<engine.scene>, shape="box", style="solid"];
"entities" [color="black", label=<entities>, shape="box", style="solid"];
"entities.bullet" [color="black", label=<entities.bullet>, shape="box", style="solid"];
"entities.captured_animation" [color="black", label=<entities.captured_animation>, shape="box", style="solid"];
"entities.enemy" [color="black", label=<entities.enemy>, shape="box", style="solid"];
"entities.explosion" [color="black", label=<entities.explosion>, shape="box", style="solid"];
"entities.player" [color="black", label=<entities.player>, shape="box", style="solid"];
"entities.rescuing_ship" [color="black", label=<entities.rescuing_ship>, shape="box", style="solid"];
"entities.tractor_beam" [color="black", label=<entities.tractor_beam>, shape="box", style="solid"];
"game" [color="black", label=<game>, shape="box", style="solid"];
"game.capture" [color="black", label=<game.capture>, shape="box", style="solid"];
"game.difficulty" [color="black", label=<game.difficulty>, shape="box", style="solid"];
"game.dive" [color="black", label=<game.dive>, shape="box", style="solid"];
"game.formation" [color="black", label=<game.formation>, shape="box", style="solid"];
"game.hud" [color="black", label=<game.hud>, shape="box", style="solid"];
"game.scoring" [color="black", label=<game.scoring>, shape="box", style="solid"];
"game.wave" [color="black", label=<game.wave>, shape="box", style="solid"];
"scenes" [color="black", label=<scenes>, shape="box", style="solid"];
"scenes.bonus" [color="black", label=<scenes.bonus>, shape="box", style="solid"];
"scenes.gameover" [color="black", label=<scenes.gameover>, shape="box", style="solid"];
"scenes.play" [color="black", label=<scenes.play>, shape="box", style="solid"];
"scenes.title" [color="black", label=<scenes.title>, shape="box", style="solid"];
"scenes.transitions" [color="black", label=<scenes.transitions>, shape="box", style="solid"];
"engine.audio" -> "engine" [arrowhead="open", arrowtail="none"];
"engine.audio" -> "engine.assets" [arrowhead="open", arrowtail="none"];
"entities.bullet" -> "engine" [arrowhead="open", arrowtail="none"];
"entities.bullet" -> "engine.assets" [arrowhead="open", arrowtail="none"];
"entities.captured_animation" -> "engine" [arrowhead="open", arrowtail="none"];
"entities.captured_animation" -> "engine.assets" [arrowhead="open", arrowtail="none"];
"entities.enemy" -> "engine" [arrowhead="open", arrowtail="none"];
"entities.enemy" -> "engine.assets" [arrowhead="open", arrowtail="none"];
"entities.enemy" -> "entities.bullet" [arrowhead="open", arrowtail="none"];
"entities.enemy" -> "game" [arrowhead="open", arrowtail="none"];
"entities.explosion" -> "engine" [arrowhead="open", arrowtail="none"];
"entities.explosion" -> "engine.assets" [arrowhead="open", arrowtail="none"];
"entities.player" -> "engine" [arrowhead="open", arrowtail="none"];
"entities.player" -> "engine.assets" [arrowhead="open", arrowtail="none"];
"entities.player" -> "engine.audio" [arrowhead="open", arrowtail="none"];
"entities.player" -> "engine.input" [arrowhead="open", arrowtail="none"];
"entities.player" -> "entities.bullet" [arrowhead="open", arrowtail="none"];
"entities.rescuing_ship" -> "engine" [arrowhead="open", arrowtail="none"];
"entities.rescuing_ship" -> "engine.assets" [arrowhead="open", arrowtail="none"];
"game.hud" -> "engine" [arrowhead="open", arrowtail="none"];
"game.hud" -> "engine.assets" [arrowhead="open", arrowtail="none"];
"game.hud" -> "game.scoring" [arrowhead="open", arrowtail="none"];
"scenes.bonus" -> "engine" [arrowhead="open", arrowtail="none"];
"scenes.bonus" -> "engine.audio" [arrowhead="open", arrowtail="none"];
"scenes.bonus" -> "engine.input" [arrowhead="open", arrowtail="none"];
"scenes.bonus" -> "engine.scene" [arrowhead="open", arrowtail="none"];
"scenes.bonus" -> "entities.enemy" [arrowhead="open", arrowtail="none"];
"scenes.bonus" -> "entities.explosion" [arrowhead="open", arrowtail="none"];
"scenes.bonus" -> "entities.player" [arrowhead="open", arrowtail="none"];
"scenes.bonus" -> "game" [arrowhead="open", arrowtail="none"];
"scenes.bonus" -> "game.difficulty" [arrowhead="open", arrowtail="none"];
"scenes.bonus" -> "game.scoring" [arrowhead="open", arrowtail="none"];
"scenes.bonus" -> "scenes.play" [arrowhead="open", arrowtail="none"];
"scenes.bonus" -> "scenes.transitions" [arrowhead="open", arrowtail="none"];
"scenes.gameover" -> "engine" [arrowhead="open", arrowtail="none"];
"scenes.gameover" -> "engine.audio" [arrowhead="open", arrowtail="none"];
"scenes.gameover" -> "engine.input" [arrowhead="open", arrowtail="none"];
"scenes.gameover" -> "engine.scene" [arrowhead="open", arrowtail="none"];
"scenes.gameover" -> "game.scoring" [arrowhead="open", arrowtail="none"];
"scenes.gameover" -> "scenes.title" [arrowhead="open", arrowtail="none"];
"scenes.play" -> "engine" [arrowhead="open", arrowtail="none"];
"scenes.play" -> "engine.audio" [arrowhead="open", arrowtail="none"];
"scenes.play" -> "engine.input" [arrowhead="open", arrowtail="none"];
"scenes.play" -> "engine.scene" [arrowhead="open", arrowtail="none"];
"scenes.play" -> "entities.captured_animation" [arrowhead="open", arrowtail="none"];
"scenes.play" -> "entities.enemy" [arrowhead="open", arrowtail="none"];
"scenes.play" -> "entities.explosion" [arrowhead="open", arrowtail="none"];
"scenes.play" -> "entities.player" [arrowhead="open", arrowtail="none"];
"scenes.play" -> "entities.rescuing_ship" [arrowhead="open", arrowtail="none"];
"scenes.play" -> "entities.tractor_beam" [arrowhead="open", arrowtail="none"];
"scenes.play" -> "game" [arrowhead="open", arrowtail="none"];
"scenes.play" -> "game.capture" [arrowhead="open", arrowtail="none"];
"scenes.play" -> "game.difficulty" [arrowhead="open", arrowtail="none"];
"scenes.play" -> "game.scoring" [arrowhead="open", arrowtail="none"];
"scenes.play" -> "game.wave" [arrowhead="open", arrowtail="none"];
"scenes.play" -> "scenes.bonus" [arrowhead="open", arrowtail="none"];
"scenes.play" -> "scenes.gameover" [arrowhead="open", arrowtail="none"];
"scenes.play" -> "scenes.transitions" [arrowhead="open", arrowtail="none"];
"scenes.title" -> "engine" [arrowhead="open", arrowtail="none"];
"scenes.title" -> "engine.audio" [arrowhead="open", arrowtail="none"];
"scenes.title" -> "engine.input" [arrowhead="open", arrowtail="none"];
"scenes.title" -> "engine.scene" [arrowhead="open", arrowtail="none"];
"scenes.title" -> "game.difficulty" [arrowhead="open", arrowtail="none"];
"scenes.title" -> "game.scoring" [arrowhead="open", arrowtail="none"];
"scenes.title" -> "scenes.play" [arrowhead="open", arrowtail="none"];
"scenes.title" -> "scenes.transitions" [arrowhead="open", arrowtail="none"];
"scenes.transitions" -> "engine.input" [arrowhead="open", arrowtail="none"];
"scenes.transitions" -> "engine.scene" [arrowhead="open", arrowtail="none"];
"engine.scene" -> "engine.input" [arrowhead="open", arrowtail="none", style="dashed"];
}
